{
  "main": {
    "name":"David Santamaria",
    "occupation":"Engineering Manager",
    "description":"",
    "image":"profilepic.jpg",
    "bio":"Software engineer interested in software analysis, architecture and development. I've been mostly focused on Web. Love to build things with quality, from the conception to the deploy. I take the software that I write very seriously while having an extreme passion for being the best I can be at doing what I love to do. Experience in leading and working with engineering teams in the architecture, specification and implementation of complex, highly scalable and performant systems.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "hi@davidsantamaria.me",
    "based": "Remote",
    "website": "https://davidsantamaria.me",
    "resumedownload":"https://davidsantamaria.me",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/davidsantamaria/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/dhighwayman",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Some of the skills that I have developed",
    "education":[
      {
        "school":"University of Deusto",
        "degree":"Computer Science engineering",
        "graduated":"July 2007"
      }
    ],
    "work":[
      {
        "company":"Cabify",
        "title":"Engineering Manager",
        "years":"May 2019 - Present",
        "description":"Tech Stack: Golang, Redis, MySQL, NSQ, gRPC,... Role: Engineering manager at Cabify. Working on the Match team and Maps & Routes team. Leading a team of 7 software engineers collaborating with product and data science to improve our marketplace. Responsibilities for this role include technical product definition and vision, technical leadership and team management. Shipped: We were in charge of the matcher, matching thousands of riders and drivers per matching round. Shipped a tool to replace Google maps on calculations of ETAs based on a machine learning model that predicts ETAs. Shipped a tool that replaces Google Maps on routes calculation."
      },
      {
        "company":"eBay",
        "title":"Junior bug fixer",
        "years":"March 2007 - February 2010",
        "description":"Tech Lead at Stubhub driving a team of 7 software engineers on several products across company collaborating with product, design and biz dev to deliver delightful user experiences. Responsibilities for this role include product definition and vision, technical leadership and team management. Other achievements: * Member of the Software Development Life Cycle Committee of the company. * Creator and driver of the Engineering culture team inside Stubhub. * Split the monolithic app into microservices."
      },
      {
        "company":"Ticketbis",
        "title":"Junior bug fixer",
        "years":"March 2007 - February 2010",
        "description":"Project leader at Ticketbis. Work tasks included coordinating the multiple teams, designed and coded new features, and build a scalable product. Leading a team of 20+ software engineers collaborating with product, design and biz dev to deliver delightful user experiences. Also part of the team responsible of fulfillment and partnerships building tools for integrate large amounts of listings into our platform. Our main challenges involve scalability, reliability and real time processing. Responsibilities for this role include product definition and vision, technical leadership and team management."
      },
      {
        "company":"AOL",
        "title":"Junior bug fixer",
        "years":"March 2007 - February 2010",
        "description":"Designed and implemented new web applications for aol.com's local team. Worked with Java, and web services. Designed and implemented web service to provide rich search results to search.aol.com team. Developed a tool to retrieve data from the backend and help in the implementation of that tool in several projects as yellowpages.aol.com and when.com. Implemented numerous improvements to citypages.aol.com and citysbest.aol.com. Performed troubleshooting of mission-critical backend and website software."
      },
      {
        "company":"In1Solutions",
        "title":"Junior bug fixer",
        "years":"March 2007 - February 2010",
        "description":"Developed backoffice applications and web development. Refactored parts of the site, and backoffice applications that already existed. Developed the hotel booking engine used by international customers."
      },
      {
        "company":"Irontec",
        "title":"Junior bug fixer",
        "years":"March 2007 - February 2010",
        "description":"Working in a telecom company. My technical work was focused on VoIP application development and systems monitoring. Directly handled customer requirements for developing call-center systems. Technical support on Voice over IP and Asterisk."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"60%"
      },
      {
        "name":"Illustrator",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"VueJs",
        "level":"50%"
      },
      {
        "name":"MongoDB",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}